source/_static/diagrams/recipe-fail.d2
direction: right
n0: "log"
n1: "cause"
n2: "fix"
n0 -> n1
n1 -> n2
